Repository: SlavaC1/ControlSW
Catalog: RaccoonBranch/Raccoon/RS-BSS/BSA/BSS.MVVM/Properties/Resources.*.resx
Languages: he_il

source: Batch end time:
he_il: זמן סיום צריבת האצווה:

source: Batch Number:
he_il: מספר האצווה:

source: Batch start time:
he_il: זמן תחילת צריבת האצווה:

# BurningEndedSuccessfully
source: Material info was burned successfully on tag #{0}.
he_il: המידע נצרב בהצלחה על גבי המיכל בתושבת {0}.

# BurningFailed
source: Failed burning material info on tag #{0}.
he_il: כשלון בצריבת המידע על גבי המיכל בתושבת {0}.

# BurningInProcess
source: Burning material info on tag #{0} started...
he_il: צריבת המידע על גבי המיכל בתושבת {0} החלה...

# BurnsCountLot
source: Number of burnings in batch:
he_il: מספר הצריבות הכולל באצווה הנוכחית:

# BurnsCountLotSuccess
source: Successfull burnings on batch:
he_il: מספר הצריבות התקינות באצווה הנוכחית:

# BurnsCountSession
source: Number of burnings on session:
he_il: מספר הצריבות הכולל בסשן הנוכחי:

# BurnsCountSessionSuccess
source: Successfull burnings on session:
he_il: מספר הצריבות התקינות בסשן הנוכחי:

# CannotTransitMessage
source: Cannot transit from state {0} to state {1}.
he_il: לא ניתן לעבור ממצב {0} למצב {1}.

source: Cartridge inserted
he_il: מיכל הוכנס

# CartridgesCount
source: Number of cartridges:
he_il: מספר המיכלים:

# CartridgeXInserted
source: Cartridge was inserted into chassis #{0}.
he_il: מיכל הוכנס לתושבת {0}.

# CartridgeXRemoved
source: Cartridge was removed from chassis #{0}.
he_il: מיכל הוצא מתושבת {0}.

source: Chassis empty
he_il: התושבת ריקה

source: Consumption Counter:
he_il: מונה צריכה:

# ConsumptionCounterValue
source: {0} Kg ({1} grams)
he_il: {0} ק"ג ({1} גרם)

source: End Lot
he_il: סיים מנה

# EndOfLot
source: Lot ended.
he_il: מנה הסתיימה.

source: End Session
he_il: סיים סשן

source: Expiration Date:
he_il: תאריך תפוגה:

# FailuresCount
source: Number of failures:
he_il: מספר הכישלונות:

source: Initial Weight:
he_il: משקל התחלתי:

# InitialWeightValue
source: {0} Kg
he_il: {0} ק"ג

# IsReference
source: Reference cartridge
he_il: מיכל Ref

source: Manufacturing Time:
he_il: תאריך ייצור:

source: Material Type:
he_il: סוג חומר:

# MissingLot
source: Lot was not read from Oracle DB.
he_il: נתוני מנה לא נקראו מהאוראקל

# NoCartridgeLeft
source: Please ensure that there is no cartridge left in chassis.
he_il: אנא וודא שכל התושבות ריקות.

source: No material info was read.
he_il: המידע לצריבה לא נקרא.

# ReadingEndedSuccessfully
source: Material info of tag #{0} was verified successfully.
he_il: המידע שבתג {0} אומת בהצלחה.

# ReadingFailed
source: Failed verifying tag #{0}.
he_il: לא ניתן לאמת את תג {0}.

# ReadingInProcess
source: Verification of tag #{0} started...
he_il: אימות תג {0} החל...

source: Serial Number:
he_il: מספר סידורי:

source: Summary
he_il: סיכום

# BurningAttemptsCount
source: Number of burnings:
he_il: מספר נסיונות צריבה:

source: Tag Struct ID:
he_il: מספר גירסא:

# TransitionSucceeded
source: System transitted from {0} to {1}.
he_il: המערכת עברה ממצב {0} למצב {1}.

source: Burning...
he_il: צורב...

# EmptyCartridge
source: Cartridge is empty.
he_il: מיכל ריק

# IdleState
source: Idle
he_il: אדיש

source: Material expired.
he_il: חומר פג תוקף.

# MaterialTypeUndefined
source: Unknown material type '{0}'.
he_il: חומר מספר '{0}' אינו מזוהה.

# OperationNotAllowedOnCartridge
source: {0} is not allowed on cartridge {1}.
he_il: פעולת ה{0} אינה חוקית בתושבת {1}.

source: Verification
he_il: אימות

# ConnectionFailed
source: Failed to connect to {0}.
he_il: כשלון בהתחברות ל-{0}.

# CannotTransitMessageForReason
source: Cannot transit from state {0} to state {1}: {2}
he_il: לא ניתן לעבור ממצב {0} למצב {1}: {2}

source: Inline
he_il: אין ליין

# InPlaceStatusInterval
source: In-place frequency (ms):
he_il: תדירות בדיקת סטאטוס (ms):

source: Standalone
he_il: עצמאית

source: Station Type:
he_il: סוג העמדה:

source: PLC Mode
he_il: מוד PLC

# BurningAttemptCount
source: Number of cycles
he_il: מספר צריבות

source: Burning Date
he_il: תאריך צריבה

# BurningStation
source: Station Name
he_il: שם עמדת הצריבה

source: Burning Time
he_il: זמן הצריבה

source: Error
he_il: שגיאה

source: Find batch by
he_il: מצא אצווה בעזרת

source: Get Report
he_il: יצר דו"ח

source: Material ID
he_il: מספר חומר

source: Message
he_il: הודעה

source: name
he_il: שם

source: Reference
he_il: Ref

# RowNumber
source: No.
he_il: מס'

source: tag
he_il: תג

source: Time
he_il: זמן

# ConnectionOK
source: Connection to {0} was initialized successfully.
he_il: תקשורת ל-{0} הוקמה בהצלחה.

# OperationInProcess
source: {0} operation is still in process. Please wait to complete.
he_il: פעולת ה{0} טרם הסתיימה. אנא המתן שתושלם.

# PlcNotReady
source: PLC connection was not successfully established.
he_il: לא בוצעה התקשרות ל PLC.

source: Cartridge Number:
he_il: מספר מיכל:

source: Verifying...
he_il: מאמת...

# ArgumentMustNotBeGreaterMessage
source: {0} must not be greater than {1}.
he_il: {0} אינו יכול להיות גדול מ - {1}.

# PlcReady
source: PLC is ready.
he_il: PLC מוכן לפעולה.

# MaterialTypeError
source: {0} material cannot be handled in chassis #{1}.
he_il: מיכל עם חומר מסוג {0} אינו יכול להיות מטופל בתושבת #{1}.

source: Model
he_il: מודל

source: Support
he_il: תמיכה

# ChassisCount
source: Number of Chassis:
he_il: מספר התושבות:

# ChassisNumber
source: Chassis {0}:
he_il: תושבת {0}:

source: Device
he_il: התקן

source: Language
he_il: שפה

source: Simulator
he_il: סימולטור

source: Station Name:
he_il: שם העמדה:

# ArgumentMustNotBeSmallerMessage
source: {0} must not be smaller than {1}.
he_il: {0} אינו יכול להיות קטן מ - {1}.

source: PLC Port:
he_il: פורט PLC:

source: Apply
he_il: ישם

source: Revert
he_il: בטל

# SessionNotStarted
source: No session has been started.
he_il: סשן לא החל.

# EndOfLotReported
source: End of lot was reported.
he_il: דווח על סיום מנה.

source: Lot is already opened.
he_il: מנה פתוחה

# NewLot
source: A new lot is read.
he_il: מנה חדשה נקראה.

# NoReferenceCartridgesInLot
source: No reference cartridges were burned in this lot. Would you still like to end this lot?
he_il: לא נצרב במנה זו שום מיכל Ref. האם לסיים את המנה בכל זאת?

# ProceedMessage
source: Would you like to proceed?
he_il: האם ניתן להמשיך?

source: User cancelled.
he_il: הפעולה בוטלה

# AppName
source: RS-BSS
he_il: ראקון

# ConfigurationParametersChanged
source: Configuration parameters had been changed. Click OK to save and exit, or Cancel to remain in management state.
he_il: ערכי התצורה השתנו. לחץ אשר לשמירה ויציאה, או לחץ בטל כדי לשחזר את התצורה הנוכחית.

# CannotCommunicateWithCBS
source: Cannot communicate with central burning server
he_il: אין תקשורת עם השרת המרכזי

# TagNotFound
source: Tag {0} is not found in VLL.
he_il: תג {0} לא נמצא ב VLL.

# TagUsed
source: Tag {0} is used.
he_il: התג {0} אינו חדש.

# IdtError
source: Tag error occurred (error code 0x{0}).
he_il: שגיאת תג (קוד 0x{0}).

# IdtError_6581
source: Tag memory error.
he_il: שגיאת זיכרון תג.

# IdtError_65FF
source: Tag communication error.
he_il: שגיאת תקשורת לתג.

# IdtError_CC13
source: Tag synchronization was lost.
he_il: תג יצא מסינכרון.

# IdtError_CF0D
source: Cannot send data to FCB.
he_il: לא ניתן לשלוח נתונים לתג.

# IdtError_CF0F
source: Cannot receive data from FCB.
he_il: לא ניתן לקבל נתונים מהתג.

# IdtError_E200
source: FCB initialization failed.
he_il: אתחול ה FCB נכשל.

# IdtError_E201
source: FCB selection failed.
he_il: בחירת FCB נכשלה..

# IdtError_E202
source: FCB get in-place status failed.
he_il: לא ניתן לקבל סטאטוס.

# IdtError_E203
source: FCB select channel failed.
he_il: לא ניתן לבחור ערוץ ב FCB.

# IdtError_E204
source: Invalid parameter was passed to FCB.
he_il: פרמטר לא חוקי הועבר ל FCB.

# IdtError_E205
source: Hardware was not initialized.
he_il: לא התבצע אתחול לחומרה.

# IdtError_E206
source: Error reading tag public key.
he_il: שגיאה בריאת המפתח הציבורי של התג.

# IdtError_E207
source: Internal authentication failed.
he_il: אימות נכשל.

# IdtError_E300
source: Invalid certificate signature.
he_il: חתימה לא תקינה.

# IdtError_E301
source: Invalid challenge token signature.
he_il: חתימה לא תקינה.

# IdtError_E302
source: Invalid certificate file.
he_il: קובץ לא חוקי.

# IdtError_E303
source: Invalid host public key.
he_il: מפתח ציבורי לא חוקי.

# IdtError_E304
source: Invalid parameter was passed to authentication.
he_il: פרמטר לא חוקי הועבר לפונקציית האימות.

# IdtError_E305
source: Tag is blank.
he_il: התג ריק.

# IdtError_E400
source: Cartridge was not authenticated.
he_il: התג לא אומת.

# IdtError_E401
source: Invalid counter signature.
he_il: חתימה לא תקינה.

# IdtError_E402
source: Material overconsumption.
he_il: זוהתה צריכת יתר.

# IdtError_E403
source: Failed to generate random token.
he_il: לא ניתן ליצר מספר אקראי.

# IdtError_E404
source: Invalid parameter was passed to consumption update.
he_il: פרמטר לא חוקי הועבר לפונקציית הצריכה.

# IdtError_E308
source: File selection failed.
he_il: לא ניתן לבחור קובץ.

# IdtError_E511
source: Failed writing IDD.
he_il: שגיאה בכתיבת נתוני הזיהוי.

# IdtError_E512
source: Failed writing signature.
he_il: שגיאה בכתיבת החתימה.

# IdtError_E210
source: Failed getting tag serial number.
he_il: לא ניתן לקבל את מספר התג.

# IdtError_E505
source: Key generation failed.
he_il: שגיאה בייצור המפתחות.

# CannotExitMessage
source: Cannot exit state {0}.
he_il: לא ניתן לצאת ממצב {0}.

# NoCartridgeBurned
source: No cartridge was burned in this lot. Burning reference cartridges is not allowed.
he_il: אף מיכל עוד לא נצרב במנה זו. לא ניתן לצרוב מיכלי Ref.

# FCBNotReady
source: FCB is not ready.
he_il: FCB אינו מוכן

source: Export to Excel
he_il: יצא לאקסל

# DBConnectionError
source: Cannot communicate with burning history DB.
he_il: לא ניתן להתחבר לבסיס הנתונים.

# HWNotReady
source: Not all hardware are ready.
he_il: לא כל הרכיבים מוכנים

source: Operation completed
he_il: פעולה הושלמה בהצלחה

source: Operation failed
he_il: פעולה נכשלה

# BurningState
source: Burning
he_il: צריבה

# MaintenanceState
source: Maintenance
he_il: תחזוקה

# ReportState
source: Reporting
he_il: דיווח

# VerificationState
source: Verification
he_il: אימות

source: PLC is busy.
he_il: PLC תפוס.

# IdtError_FFFFFFFF
source: FCB access error, please restart FCB.
he_il: שגיאת FCB, אנא אתחל FCB מחדש.

# PlcTimeout
source: PLC has not responded for {0} seconds: communication is lost.
he_il: PLC לא הגיב ב {0} השניות האחרונות: תקשורת ניתקה.

source: Debug
he_il: דיבאג

source: Execution mode:
he_il: מוד הרצה:

source: Normal
he_il: רגיל

# BurningEnded
source: Burning material info on tag #{0} ended.
he_il: צריבת המידע על גבי המיכל בתושבת {0} הסתיימה.

source: Reset
he_il: אפס

source: Application
he_il: אפליקציה

# ConnectTo
source: Connect
he_il: התחבר

source: Hardware
he_il: חומרה

source: Station
he_il: תחנה

source: Configuration
he_il: קונפיגורציה

source: Burning/Verification Privileges:
he_il: הרשאות צריבה/אימות:

source: Chassis
he_il: תושבות

source: Domain:
he_il: דומיין:

# InvalidUserNamePassword
source: Invalid user name or password.
he_il: שם משתמש או סיסמא לא תקינים.

source: Model/Support Privileges:
he_il: הרשאות מודל/תמיכה:

source: OK
he_il: אשר

source: Password:
he_il: סיסמא:

source: Sending client credential...
he_il: שולח פרטי לקוח...

source: User name:
he_il: שם משתמש:

# BatchNumbersReadSuccessfully
source: Batch numbers were read successfully.
he_il: מספרי האצוות נקראו בהצלחה.

# Find
source: Search
he_il: חפש

# GeneratingReport
source: Generating report for batch {0}...
he_il: מחולל דו"ח עבור אצווה {0}...

# ReadingBatchNumbers
source: Reading batch numbers from DB...
he_il: קורא את מספרי האצוות מבסיס הנתונים...

# ReportGeneratedSuccessfully
source: Report for batch {0} was generated successfully.
he_il: הדו"ח עבור אצווה {0} חולל בהצלחה.

# ExportingToExcel
source: Exporting report to file {0}...
he_il: מייצא דו"ח לקובץ {0}...

# ExportToExcelSucceeded
source: Report was exported to excel successfully.
he_il: הדו"ח יוצא לאקסל בהצלחה.

# CorrectionState
source: Correction
he_il: תיקון

# CannotCorrectBlankTag
source: Tag is blank: Please burn tag in burning mode.
he_il: התג ריק: אנא צרוב את התג במוד צריבה.

# CartridgeCannotBeRead
source: Cartridge inserted into chassis #{0} cannot be read.
he_il: מיכל הוכנס לתושבת {0} אינו קריא.

# OverrideTagConfirmation
source: Are you sure you want to override tag identification data?
he_il: האם אתה בטוח שיש לדרוס את המידע שעל גבי התג?

# ContinueCorrection
source: Do you have more cartridges to be corrected in this lot?
he_il: האם נותרו מיכלים נוספים לתיקון עבור מנה זו?

source: Correcting....
he_il: מתקן....

# IdtError_CF0E
source: Cannot receive data from FCB.
he_il: לא ניתן לקבל נתונים מהתג.

# IdtError_E307
source: Challenge token failed.
he_il: שגיאה באתגר אימות.

source: Cancel
he_il: בטל

# ExportReportToExcel
source: Exporting report to excel...
he_il: מייצא דו"ח לאקסל...

# FillingReport
source: Generating report...
he_il: מייצר דו"ח...

# CorrectionFailed
source: Correction failed: returning to idle state.
he_il: תיקון נכשל: חזרה למצב אדיש.

# NoCartridgesInLot
source: No cartridges were burned in this lot. Would you still like to end this lot?
he_il: לא נצרב במנה זו שום מיכל. האם לסיים את המנה בכל זאת?

# SignatureError
source: Error signing data.
he_il: שגיאה בחתימה על המידע.
